{
"help": {
	"invalid": "Not a valid command. Please type a valid command to get help information and usage for that command.",
	"header": "Stuck? Click to join our support server!", 
	"cmdlist": "*The prefix for this guild is m/* \n \n **Here is a full list of commands!** \n \n **status:** Displays information for Java Edition servers \n **bedrock:** Displays information for Bedrock Edition servers \n **suggest:** Sends feedback or suggestions to the developers \n **help:** Displays usage information for each command \n **invite:** Sends a link to invite the bot to a server \n **save: ** Allows Admins to configure the bot \n **check: ** Checks the status of the saved Minecraft server for this guild \n **automsg: ** Sends the automatically updating Live Status Panel \n **settings: ** Displays the current configuration options for your server. \n **reset: ** Resets all bot settings to their default values. \n \n For usage and more information on each command, use **m/ help [command]** \n \n Example: ```m/ help save```",
	"check": "Checks the status of the Minecraft server saved using **m/ save server** \n Usage: ```m/ check```",
	"bedrock": "Checks the status of a Bedrock Edition server. \n Usage: ```m/ bedrock [ip] [port (optional)]``` \n \n IP: The address of the server you wish to check \n Port: The port number of the server you wish to check. Only required if the server is not using port 19132. \n \n Example: ```m/ bedrock play.example.com 12345```",
	"stat": "Checks the status of a Java Edition server. \n Usage: ```m/ status [ip] [port (optional)]``` \n \n IP: The address of the server you wish to check \n Port: The port number of the server you wish to check. Only required if the server is not using port 25565. \n \n Example: ```m/ status play.example.com 12345```",
	"suggest": "Sends a suggestion to the bot’s developers. \n Usage: ```m/ suggest [suggestion]``` \n \n -Suggestions must be greater than 10 characters in length \n -Server invites are blocked from suggestions \n -You may only send one suggestion every 15 minutes \n -No advertising or spamming in the suggestions \n \n Example: ```m/ suggest please add my idea to the bot```",
	"help": "Displays usage information for each command. \n Usage: ```m/ help [command]``` \n Example: ```m/ help save server```",
	"invite": "Sends a link to invite the bot to a server. \n Usage: ```m/ invite```",
	"automsg": "Sends a message that is automatically updated with the server's current status. \n \n Usage: ```m/ automsg [server type] [ip] [port(optional)]``` \n \n -The interval at which the message refreshes will vary depending on current load factors. \n -Up to five Live Status Panels are allowed per Discord server. \n \n Example: ```m/ automsg java play.example.com 12345``` \n \n If you have configured a default saved server with the **save** command, the server argument may be omitted and the message will generate using it. \n \n Usage (Using Default Server): ```m/ automsg```",
	"settings": "Displays the current configuration options for your server. \n \n Usage: ```m/ settings```",
	"reset": "Resets all bot settings back to their default values and disables all Live Status panels. \n \n Usage: ```m/ reset```",
	"save": {
		"root": "Allows administrators to change settings for the bot. \n Usage: ```m/ save [setting] [arguments]``` \n \n server: Changes the default saved Minecraft server for this guild. \n prefix: Changes the prefix used in commands issued in this guild. \n \n For more information on each setting, use ```m/ help save [setting]```",
		"server": "Configures the default stored Minecraft server for this guild. \n Usage: ```m/ save server [server type] [ip] [port(optional)]``` \n \n -Server type must be either **bedrock** or **java** \n -This is the server that is used by the check command. \n \n The port number is only required when a port other than 25565 for Java and 19132 for Bedrock is being used. \n \n Example: ```m/ save server java play.example.com 12345```",
		"channel": "Sets the channels used for the Live Status Module. \n Usage: ```m/ save channel [info] [id]``` \n \n Info: One of the four supported types of information \n -status (Whether the Minecraft server is Online or Offline) \n -name (The display name (motd) of the Minecraft server) \n -count (The number of players online out of the maximum) \n -version (The version of the Minecraft server) \n \n ID: The ID number of the channel you wish to use for that item. To get your channel’s ID, enable the Developer Mode option in your Appearance settings and then right click (Desktop) or press and hold (mobile) on your channel and click “Copy ID”. \n \n Example: ```m/ save channel count 687524205410910217```",
		"livestatus": "Enables or Disables the Live Status Module. \n \n Usage: ```m/ save livestatus [enable/disable]``` \n \n -Before enabling the Live Status Module, ensure that a Minecraft server has been saved using **m/ save server** and at least one channel has been configured using **m/ save channel** \n -Before enabling the Live Status Module, ensure that the bot has the correct permissions. The easiest way to do this is to simply grant the bot the **Administrator** permission, which will give it channel overrides, but you can also simply grant the bot the **Manage Channels** permission and go into each channel configured using **m/ save channel** and give it **Manage Channel** permissions there. \n -The Live Status Module will be disabled if any error (such as missing permissions) occurs. Use **m/ diagnose** to see what caused the problem. \n -The Live Status Module will be disabled if the configured server is offline for more than two weeks. \n -The Live Status Module refreshes the names of the channels every 5 minutes and 30 seconds. This is a limit imposed on the bot by Discord and can not be changed. \n \n Example: ```m/ livestatus enable```",
		"prefix": "Changes the prefix used by the bot in this guild. \n Usage: ```m/ save prefix [prefix]``` \n \n -Prefix must not be longer than 10 characters \n -Prefix must not contain spaces \n \n If you forget the prefix, ping the bot to display the help menu."
	},
	"diag_0": "The Live Status Module has not been enabled in this guild. To enable the service, run ```m/ save livestatus enable```",
	"diag_1": "The Live Status Module has been disabled in this guild because your configured server has been unreachable for more than two weeks. Please check your saved server. To re-enable the module and clear this error, run ```m/ save livestatus enable```",
	"diag_2": "The Live Status Module has been disabled in this guild because the following channel(s) have been deleted or are not visible to the bot. Check your settings and try again."
},
"error": {
	"maxPanels": "Only 5 Live Status Panels are allowed per guild. Please delete one before continuing.",
	"saveServer": "**Incorrect Command Syntax** \n **Usage:** \n \n The port argument is only required on servers that use ports other than 25565 for Java and 19132 for Bedrock. \n \n m/ save server [Server Type (java or bedrock)] [Server IP] [Server Port (Optional)] \n \n **Example:** \n ```m/ save server java mc.hypixel.net 25565```",
	"serverOffline": {"body": ":red_circle: **Server is offline** \n \n Check your command and try again. \n -It is not neccessary to type the port number if the default port is being used. \n -Correct syntax example: mc.example.com 12345 \n **Additional Error Information: **", "heading": "Unable to retrieve status."},
	"requiresAdmin": "Using this command requires the **Administrator** permission.",
	"noDM": "This command can't be used in a direct message.",
	"invalidChars": "Request contains invalid characters. Please check your command for non ASCII characters or emojis and try again.",
	"cooldown": "Please wait 7 seconds before issuing another command.",
	"commandLength": "Commands must be fewer than 1500 characters in length.",
	"noIP": "Please enter a valid server IP. If you are trying to check the status of a saved server, use the **check** command.",
	"missingPerms": "Unable to process your request because the bot lacks the **Send Messages, Embed Links** or **Attach Files** permission. Please ensure the bot has these permissions in your server or contact the server's staff.",
	"suggestionLength": "Suggestion must be greater than 10 characters in length.",
	"suggestionProhibited": "Unable to send suggestion because it contains a prohibited term. Please check your suggestion and try again. Your suggestion contained: **",
	"badPort": "Port argument must be between 1 and 65535. Please check your command and try again.",
	"suggestionCooldown": "Please wait 15 minutes before sending another suggestion.",
	"suggestionError": "An error has occured while submitting your suggestion. Please try again later.",
	"database": "An error has occured reading the database. Please notify the bot developers.",
	"badData": "Server returned missing or corrupt data. (The server might still be in the process of starting up, try again later)",
	"noSaved": "No Saved Servers have been configured in this guild.",
	"invalidSetting": "Please specify a setting to change. Valid settings are: server and prefix.",
	"prefixLength": "Prefix length must be no more than 10 characters.",
	"restricted": "You do not have sufficent permissions to access that command.",
	"blacklisted": "Unable to process command because you have been blacklisted from the bot. This message will only be sent once. To appeal, join the support server.",
	"annChannel": "The **automsg** command is not compatable with announcement channels. Please use a normal text channel and try again.",
	"checkArgs": "Trying to ping a server? The **check** command is only used to check the default server saved to the database and does not accept arguments.",
	"ipLength": "Your IP Address/Domain name must be between 5 and 253 characters. Please check your command and try again.",
	"automsgSyntax": "**Incorrect Command Syntax** \n **Usage:** \n \n The port argument is only required on servers that use ports other than 25565 for Java and 19132 for Bedrock. \n \n m/ automsg [Server Type (java or bedrock)] [Server IP] [Server Port (Optional)] \n \n **Example:** \n ```m/ automsg java mc.hypixel.net 25565```",
	"reactionPerms": "Unable to use this feature because the bot lacks the **Add Reactions** permission in this channel. Please ensure the bot has these permissions in your server or contact the server's staff.",
	"channelPerms": "Unable to use this feature because the bot lacks the **Manage Channels** permission in this guild. Please ensure the bot has these permissions in your server or contact the server's staff.",
	"thumbnailSize": "Custom thumbnails must not exceed 5MB in size.",
	"aliasNotFound": "Unable to locate a saved server with that alias."
},
"miscEmbeds": {
	"serverList": {
		"default": " **(Default)**"
	},
	"serverRemoved": "Successfully removed the following server from the database: ",
	"userCommands": {
		"invalidUser": "Please enter a valid user ID.",
		"invalidAction": "Please enter a valid action. Actions are: admin, support, blacklist and info.",
		"userBlacklisted": "** has been added to the blacklist.",
		"blacklistRemoved": "** has been removed from the blacklist.",
		"adminRemoved": "** is no longer an administrator user.",
		"adminAdded": "** is now an administrator user.",
		"supportAdded": "** is now a support user.",
		"supportRemoved": "** is no longer a support user."
	},
	"footerText": "Generated by Minecraft Server Status Bot",
	"invite": {
		"title": "Click here to join the support server!",
		"body": "Want to add Minecraft Server Status to your server? \n [Click here to invite the bot](https://discord.com/api/oauth2/authorize?client_id=652726107535310859&permissions=52304&scope=bot) \n \n Interested in the beta program? \n [Click here to invite the Beta bot](https://123computer.net/mcss/beta)"
		},
	"suggestionSent": "Your suggestion has been sent to our staff.",
	"serverSet": "The saved server for this guild has been set to **",
	"prefixSet": "The prefix for this guild has been changed to **",
	"stats": {
		"title": "Status for ",
		"header": ":green_circle: Server is online",
		"type": "**Type: **",
		"version": "**Version: **",
		"motd": "**MOTD: **",
		"max": "**Maximum Players: **",
		"now": "**Currently Online: **",
		"latency": "**Latency: **",
		"players": "**Players: **"
	},
	"reply": {
		"error": "Error",
		"notif": "Information"
	},
	"settings": {
		"header": "Configuration Options for ",
		"nc": "Not Configured",
		"id": "**Guild ID: **",
		"prefix": "**Prefix: **",
		"server": "**Minecraft Server: **",
		"lmchan": "**Live Message Channel ID: **",
		"mesid": "**Live Message ID: **",
		"messageLink": "Link to Message"},
	"reset": {
	"confirmation": "This command will reset ALL settings including your prefix and saved server and remove all Live Status panels from the database. Are you sure you want to continue?",
	"finished": "Successfully reset bot to default settings.",
	"cancelled": "Settings reset has been cancelled."},
	"createSuccessful": "Successfully created Live Status",
	"servers": {
		"listHeading": "Saved servers for "
	}
},
"livestatus": {
"disabled": {"header": "Live Status Disabled", "body": "Your server has been unreachable for over two weeks and the live status message has been disabled in this guild."},
"lu": "Last updated",
"lp": "Last Successful Ping:"
}
}