{
"help": {
	"header": "Sei bloccato? Fai clic per unirti al nostro server di supporto!", 
	"cmdlist": "*Il prefisso per il tuo server è m/* \n \n **Ecco un elenco completo dei comandi!** \n **-È necessario inserire uno spazio tra il prefisso e il comando** \n \n **status:** Visualizza le informazioni per i server Java Edition \n **bedrock:** Visualizza le informazioni per i server Bedrock Edition \n **suggest:** Invia feedback o suggerimenti agli sviluppatori \n **help:** Visualizza le informazioni sull'utilizzo per ogni comando \n **invite:** Invia un collegamento per invitare il bot a un server \n **save: ** Consente agli amministratori di configurare il bot \n **check: ** Controlla lo stato del server Minecraft salvato su questo Discord \n **automsg: ** Invia un messaggio di stato contenente le informazioni del server che verrà aggiornato automaticamente \n \n Per l'utilizzo e ulteriori informazioni su ogni comando, usa **m/ help [comando]** \n \n Esempio: ```m/ help save```",
	"check": "Controlla lo stato del server Minecraft che hai salvato utilizzando **m/ save server** \n Usa: ```m/ check```",
	"bedrock": "Controlla lo stato di un server Bedrock Edition. \n Usa: ```m/ bedrock [ip] [porta (opzionale)]``` \n \n IP: L'indirizzo del server che desideri controllare \n Porta: Il numero di porta del server che desideri controllare. Richiesto solo se il server NON utilizza la porta 19132. \n \n Esempio: ```m/ bedrock play.esempio.com 12345```",
	"stat": "Controlla lo stato di un server Java Edition. \n Usa: ```m/ status [ip] [porta (opzionale)]``` \n \n IP: L'indirizzo del server che desideri controllare \n Porta: Il numero di porta del server che desideri controllare. Richiesto solo se il server NON utilizza la porta 25565. \n \n Esempio: ```m/ status play.esempio.com 12345```",
	"suggest": "Invia un suggerimento agli sviluppatori del bot. \n Usa: ```m/ suggest [suggerimento]``` \n \n -I suggerimenti devono contenere più di 10 caratteri \n -Gli inviti al server sono bloccati dai suggerimenti \n -Puoi inviare solo un suggerimento ogni 15 minuti \n -Nessuna pubblicità o spam nei suggerimenti \n \n Esempio: ```m/ suggest per favore aggiungi la mia idea al bot```",
	"help": "Visualizza le informazioni sull'utilizzo di ogni comando. \n Usa: ```m/ help [comando]``` \n Esempio: ```m/ help save server```",
	"invite": "Invia un link per invitare il bot ad un server. \n Usa: ```m/ invite```",
	"automsg": "Invia un messaggio che viene aggiornato automaticamente ogni due minuti con lo stato del server salvato. \n \n Usa: ```m/ automsg```",
	"save": {
		"root": "Consente agli amministratori di modificare le impostazioni del bot. \n Usa: ```m/ save [setting] [argomento]``` \n \n server: Modifica il server Minecraft salvato per questa server Discord. \n prefisso: Modifica il prefisso utilizzato nei comandi emessi in questa server. \n \n Per ulteriori informazioni su ciascuna impostazione, utilizzare ```m/ help save [setting]```",
		"server": "Configura il server Minecraft da memorizzarein questo server Discord. \n Usa: ```m/ save server [tipo di server] [ip] [porta(opzionale)]``` \n \n -Il tipo di server deve essere uno dei due **bedrock** or **java** \n \n Il numero di porta è richiesto solo quando viene utilizzata una porta diversa da 25565 per Java e 19132 per Bedrock. \n \n Esempio: ```m/ save server java play.esempio.com 12345```",
		"channel": "Imposta i canali utilizzati per l'aggiornamento dello stato del server. \n Usa: ```m/ save channel [info] [id]``` \n \n Info: Uno dei quattro tipi di informazioni supportati \n -stato (Se il server Minecraft è online o offline) \n -nome (Il nome visualizzato (motd) del server Minecraft) \n -count (Il numero di giocatori online rispetto al massimo) \n -versione (La versione del server Minecraft) \n \n ID: Il numero ID del canale che desideri utilizzare per quell'elemento. Per ottenere l'ID del tuo canale, abilita l'opzione Modalità sviluppatore nelle impostazioni di Aspetto, quindi fai clic con il pulsante destro del mouse (desktop) o tieni premuto (dispositivo mobile) sul tuo canale e fai clic su “Copia ID”. \n \n Esempio: ```m/ save channel count 687524205410910217```",
		"livestatus": "Abilita o disabilita il modulo Stato in Tempo Reale. \n \n Usa: ```m/ save livestatus [enable/disable]``` \n \n -Prima di abilitare il modulo di Stato in Tempo Reale, assicurati che un server Minecraft sia stato salvato utilizzando **m/ save server** e almeno un canale sia stato configurato utilizzando **m/ save channel** \n -Prima di abilitare il modulo di stato in tempo reale, assicurarsi che il bot disponga delle autorizzazioni corrette. Il modo più semplice per farlo è semplicemente concedendo al bot il permesso **Amministratore**, che gli darà i permessi necessati nel canale, ma puoi anche semplicemente concedere al bot il permesso **Gestisci canali** nel canale configurato usando **m/ save channel**. \n -Il modulo di stato in tempo reale verrà disabilitato se si verifica un errore (come la mancanza di autorizzazioni). Usa **m/ diagnose** per vedere cosa ha causato il problema. \n -Il modulo di stato in tempo reale verrà disabilitato se il server configurato è offline per più di due settimane. \n -Il modulo di stato in tempo reale aggiorna i nomi dei canali ogni 5 minuti e 30 secondi. Questo è un limite imposto al bot da Discord e non può essere modificato. \n \n Esempio: ```m/ livestatus enable```",
		"prefix": "Modifica il prefisso utilizzato dal bot in questo server. \n Usa: ```m/ save prefix [prefisso]``` \n \n -Il prefisso non deve essere più lungo di 10 caratteri \n -Il prefisso non deve contenere spazi \n \n Se dimentichi il prefisso, esegui il ping del bot per visualizzare il menu di aiuto."
	},
	"diag_0": "Il modulo Live Status non è stato abilitato in questo server. Per abilitare il servizio, esegui ```m/ save livestatus enable```",
	"diag_1": "Il modulo Live Status è stato disabilitato in questa server Discord perché il tuo server Minecraft configurato è stato irraggiungibile per più di due settimane. Per favore controlla il server che hai salvato. Per riattivare il modulo e cancellare questo errore, esegui ```m/ save livestatus enable```",
	"diag_2": "Il modulo Live Status è stato disabilitato in questa server perché i seguenti canali sono stati eliminati o non sono visibili al bot. Controlla le impostazioni e riprova."
},
"error": {
	"saveServer": "**Sintassi dei comandi errata** \n **Usa:** \n \n L'argomento port è richiesto solo sui server che utilizzano porte diverse da 25565 per Java e 19132 per Bedrock. \n \n m/ save server [Tipo di Server (java or bedrock)] [Server IP] [Server Port (Opzionale)] \n \n **Esempio:** \n ```m/ save server java mc.hypixel.net 25565```",
	"serverOffline": {"body": ":red_circle: **Il server è offline** \n \n Controlla il comando e riprova. \n -Non è necessario digitare il numero di porta se si utilizza la porta predefinita. \n -Esempio di sintassi corretta: mc.esempio.com 12345 \n **Ulteriori informazioni sugli errori: **", "heading": "Impossibile recuperare lo stato."},
	"requiresAdmin": "L'utilizzo di questo comando richiede l'autorizzazione **Amministratore**.",
	"noDM": "Questo comando non può essere utilizzato in un messaggio privato.",
	"invalidChars": "La richiesta contiene caratteri non validi. Controlla il comando e assicurati che NON contenga caratteri NON ASCII o emoji e riprova.",
	"cooldown": "Attendi 7 secondi prima di emettere un altro comando.",
	"commandLength": "I comandi devono contenere meno di 1500 caratteri.",
	"noIP": {"body": "Inserisci un IP del server valido. Se stai cercando di controllare lo stato di un server salvato, usa il comando **check**.", "heading": "Impossibile recuperare lo stato."},
	"missingPerms": "Impossibile elaborare la tua richiesta perché il bot non ha il permesso **Inviare messaggi, Incorpora link** o il permesso **Allegare file**. Assicurati che il bot abbia queste autorizzazioni nel tuo server o contatta lo staff del server.",
	"suggestionLength": "Il suggerimento deve contenere più di 10 caratteri.",
	"suggestionInvite": "L'invio di link di invito nei suggerimenti non è consentito.",
	"badPort": "L'argomento della porta deve contenere solo numeri ed essere compreso tra 1 e 65535. Controllare il comando e riprovare.",
	"suggestionCooldown": "Attendi 15 minuti prima di inviare un altro suggerimento.",
	"database": "Si è verificato un errore durante la lettura del database. Si prega di avvisare gli sviluppatori del bot.",
	"badData": "Il server ha restituito dati mancanti o danneggiati. (Il server potrebbe essere ancora in fase di avvio, riprova più tardi)",
	"noSaved": "Nessun server è stato salvato e/o configurato in questa gilda.",
	"invalidSetting": "Si prega di specificare un'impostazione da modificare. Le impostazioni valide sono: server e prefix.",
	"prefixLength": "La lunghezza del prefisso non deve superare i 10 caratteri.",
	"restricted": "Bel tentativo, ma solo il mio proprietario può eseguire quel comando."
},
"miscEmbeds": {
	"footerText": "Generato da Minecraft Server Status Bot",
	"invite": "Fare clic qui per invitare il bot",
	"suggestionSent": "Il tuo suggerimento è stato inviato al nostro staff.",
	"serverSet": "Il server salvato su questo Discord è stato impostato su **",
	"prefixSet": "Il prefisso per questa server è stato cambiato in **",
	"stats": {
		"title": "Stato per ",
		"header": ":green_circle: Il server è online",
		"type": "**Tipo: **",
		"version": "**Versione: **",
		"motd": "**MOTD: **",
		"max": "**Giocatori Massimi: **",
		"now": "**Attualmente Online: **",
		"latency": "**Latenza: **",
		"players": "**Players: **"
	},
	"reply": {
		"error": {"heading": "Errore", "body": "**Descrizione dell'errore:**"},
		"notif": "Informazione"
	}
},
"livestatus": {
"disabled": {"header": "Stato live disabilitato", "body": "Il tuo server Minecraft è stato irraggiungibile per oltre due settimane e il messaggio di stato live è stato disabilitato in questo Discord."},
"lu": "Ultimo aggiornamento",
"lp": "Ultimo ping riuscito:"
}
}